## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 12 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                            |
|--------|------------------------------------------------------------|
| add    | `aws_alb_listener.internal_alb_tls`                        |
|        | `aws_alb_target_group.internal_nginx_http`                 |
|        | `aws_iam_policy.secrets_csi`                               |
|        | `aws_iam_role.secrets_csi`                                 |
|        | `aws_iam_role_policy_attachment.secrets_csi`               |
|        | `aws_iam_role_policy_attachment.worker_csi`                |
|        | `aws_lb.internal_alb`                                      |
|        | `aws_route53_record.notification_internal_dns`             |
|        | `aws_route53_record.wildcard_CNAME`                        |
|        | `aws_secretsmanager_secret.nginx_target_group_arn`         |
|        | `aws_secretsmanager_secret_version.nginx_target_group_arn` |
|        | `aws_security_group.notification_internal`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb_listener.internal_alb_tls will be created
  + resource "aws_alb_listener" "internal_alb_tls" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2019-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_alb_target_group.internal_nginx_http will be created
  + resource "aws_alb_target_group" "internal_nginx_http" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "notification-internal-nginx-http"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-097508d1f5e243195"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "404"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_iam_policy.secrets_csi will be created
  + resource "aws_iam_policy" "secrets_csi" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "secrets-csi-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.secrets_csi will be created
  + resource "aws_iam_role" "secrets_csi" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:nginx:ingress-nginx-ingress"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "secrets-csi-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.secrets_csi will be created
  + resource "aws_iam_role_policy_attachment" "secrets_csi" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "secrets-csi-role"
    }

  # aws_iam_role_policy_attachment.worker_csi will be created
  + resource "aws_iam_role_policy_attachment" "worker_csi" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-worker-role"
    }

  # aws_lb.internal_alb will be created
  + resource "aws_lb" "internal_alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = true
      + enable_deletion_protection                  = true
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = true
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "notify-staging-internal-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags                                        = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + tags_all                                    = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Name"       = "notification-canada-ca"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + access_logs {
          + bucket  = "cbs-satellite-239043911459"
          + enabled = true
          + prefix  = "inernal_lb_logs"
        }
    }

  # aws_route53_record.notification_internal_dns will be created
  + resource "aws_route53_record" "notification_internal_dns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.notification.internal"
      + type            = "A"
      + zone_id         = "ZQSVJUPU6J1EY"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.wildcard_CNAME will be created
  + resource "aws_route53_record" "wildcard_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.staging.notification.internal"
      + records         = [
          + "staging.notification.internal",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "ZQSVJUPU6J1EY"
    }

  # aws_secretsmanager_secret.nginx_target_group_arn will be created
  + resource "aws_secretsmanager_secret" "nginx_target_group_arn" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "NGINX_TARGET_GROUP_ARN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.nginx_target_group_arn will be created
  + resource "aws_secretsmanager_secret_version" "nginx_target_group_arn" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.notification_internal will be created
  + resource "aws_security_group" "notification_internal" {
      + arn                    = (known after apply)
      + description            = "Ingress - Application load balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "notification-canada-ca-alb-internal"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all               = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + vpc_id                 = "vpc-097508d1f5e243195"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eks_csi_role_arn                       = (known after apply)
  + internal_nginx_target_group_arn        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.aggregating-queues-not-active-1-minute-warning[0]"]
WARN -...
```

</details>
